Repository: running-grass/omegat
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The command C-h I (describe-input-method) describes an input method—either a specified input method, or by default the input method currently in use.
zh_cn: 命令C-h I(describe-input-method)描述一种输入法-指定的输入法，或默认情况下当前使用的输入法。

source: The command C-h h (view-hello-file) displays the file etc/HELLO, which demonstrates various character sets by showing how to say “hello” in many languages.
zh_cn: 命令C-h h(view-hello-file)显示文件etc/HELLO，该文件通过显示如何用多种语言说“hello”来演示各种字符集。

source: The command C-x = (what-cursor-position) shows information about the current cursor position and the buffer contents at that position.
zh_cn: 命令C-x =(what-cursor-position)显示有关当前光标位置和该位置的缓冲区内容的信息。

source: The command C-x z (repeat) provides another way to repeat an Emacs command many times.
zh_cn: 命令C-x z(repeat)提供了将一个Emacs命令重复多次的另一种方法。

source: The command M-x count-words does the same job, but with a different calling convention.
zh_cn: 命令M-x count-words执行相同的任务，但具有不同的调用约定。

source: The command prompts for a selection criterion, which is a boolean logic expression with tags, like ‘+work+urgent-withboss’ or ‘work|home’ (see Tags).
zh_cn: 该命令会提示你输入筛选条件，该条件可使用布尔表达式，如“+word+urgent-withboss”或"work | home"（详见 标签）。

source: The command prompts for the sorting method, which can be alphabetically, numerically, by time—first timestamp with active preferred, creation time, scheduled time, deadline time—by priority, by TODO keyword—in the sequence the keywords have been defined in the setup—or by the value of a property.
zh_cn: 该命令提示您输入排序方法，该方法可以按字母顺序、数字顺序，也可以首次有效时间戳、创建时间、计划时间、截止日期时间排序，同样也可以按优先级、按TODO关键字（按照关键字在设置中定义的顺序）或按属性的值进行排序。

source: The command that is bound to such keys has a generic name, like org-metaright.
zh_cn: 绑定到此类键的命令具有通用名称，例如org-metaright。

source: The command then inserts the corresponding character into the buffer.
zh_cn: 然后，该命令将相应的字符插入到缓冲区中。

source: The commands available in the Agenda buffer are listed in Agenda Commands.
zh_cn: 议程命令中列出了议程缓冲区中可用的命令。

source: The commands available in the TODO list are described in Agenda Commands.
zh_cn: 议程相关命令中提供了在议程buffer中的可用命令。

source: The commands available in the tags list are described in Agenda Commands.
zh_cn: 要了解tags list视图中的可用命令,请参见议程视图中的命令。

source: The completion percentage you see on the screenshot is yet another neat feature of Orgmode :)
zh_cn: 您在屏幕截图上看到的完成百分比是Orgmode的另一个出色的功能：)

source: The cursor in the selected window shows the location where most editing commands take effect, which is called point2.
zh_cn: 选定窗口中的光标是大多数编辑命令生效的位置，称为游标2。

source: The date/time prompt
zh_cn: 日期/时间提示

source: The default behavior is to display the binding for 2 seconds.
zh_cn: 默认行为是显示绑定2秒。

source: The default completion styles are (in order):
zh_cn: 默认补全风格为(按顺序)：

source: The default is nil.
zh_cn: 默认值为nil。

source: The default number of days displayed in the agenda is set by the variable org-agenda-span.
zh_cn: 议程中显示的默认天数由变量org-agenda-span设置。

source: The default value is 0.25.
zh_cn: 默认值为0.25。

source: The default value is grow-only, which means the behavior we have just described.
zh_cn: 默认值是grow-only，这意味着我们刚才描述的行为。

source: The default value is nil on systems that have case-sensitive file-names, such as GNU/Linux; it is non-nil on systems that have case-insensitive file-names, such as Microsoft Windows.
zh_cn: 在具有区分大小写的文件名的系统(如GNU/Linux)上，默认值为nil；在具有不区分大小写的文件名的系统(如Microsoft Windows)上，默认值为非nil。

source: The default value of confirm-kill-emacs is nil.
zh_cn: confirm-kill-emacs的默认值为nil。

source: The default value, after-completion, gives the behavior we have just described.
zh_cn: 缺省值after-completion给出了我们刚才描述的行为。

source: The defaults put into the “future history” in this case are controlled by the functions mentioned in the value of the option file-name-at-point-functions.
zh_cn: 在这种情况下，放入“未来历史”中的默认值由选项file-name-at-point-functions的值中提到的函数控制。

source: The details of how this command works depend on the major mode.
zh_cn: 此命令如何工作的详细信息取决于主模式。

source: The diary allows you to keep track of anniversaries, lunar phases, sunrise/set, recurrent appointments (weekly, monthly) and more.
zh_cn: 这本日记可以让你记录周年纪念日、农历相位、日出/日落、定期约会(每周、每月)等等。

source: The dispatcher offers the following default commands:
zh_cn: 议程调度程序提供了以下一些默认命令：

source: The downloaded archive contains contributed libraries that are not included in Emacs.
zh_cn: 下载的档案包含Emacs中没有的贡献库。

source: The easiest way to do this is to use the command
zh_cn: 最简单的方式就是使用命令

source: The easiest way to specify a numeric argument is to type a digit and/or a minus sign while holding down the Meta key.
zh_cn: 指定数字参数的最简单方法是在按住Meta键的同时键入数字或减号。

source: The easy way to get rid of extra blank lines is with the command C-x C-o (delete-blank-lines).
zh_cn: 删除多余空行的简单方法是使用命令C-x C-o(delete-blank-lines)。

source: The echo area is also used to display an error message when a command cannot do its job.
zh_cn: 回显区还用于在命令无法执行其工作时显示错误信息。

source: The echo area is also used to display the minibuffer, a special window where you can input arguments to commands, such as the name of a file to be edited.
zh_cn: 回显区还用于显示迷你缓冲区，这是一个特殊窗口，您可以在其中为命令输入参数，例如要编辑的文件名。

source: The echo area is so-named because one of the things it is used for is echoing, which means displaying the characters of a multi-character command as you type.
zh_cn: 回显区之所以这样命名，是因为它的用途之一是回显，这意味着在您键入时显示多字符命令的字符。

source: The entire Emacs manual is available within Info, along with many other manuals for the GNU system.
zh_cn: 整个Emacs手册以及GNU系统的许多其他手册都可以在Info中找到。

source: The executed command is added to the front of the command history unless it is identical to the most recent item.
zh_cn: 执行的命令将添加到命令历史记录的前面，除非它与最近的项目相同。

source: The existence of a key binding does not stop you from running the command by name.
zh_cn: 键绑定的存在不会阻止您按名称运行该命令。

source: The extracted information is displayed in a special agenda buffer.
zh_cn: 检索出来的信息会显示在一个特殊的agenda buffer中。

source: The file is added to the front of the list.
zh_cn: 当前文件会被添加在变量列表的首位。

source: The first C-x z repeats the command once, and each subsequent z repeats it once again.
zh_cn: 第一个C-x z重复该命令一次，随后的每个z重复一次。

source: The first action of each project is called its “next action”, and that’s always the one I will do when working on a project.
zh_cn: 每个项目的第一个行动被称为“下一步行动”，这也是我在处理项目时总是要做的。

source: The first two are opened in Emacs, and the third using a web browser via the browse-url command (see Browse-URL).
zh_cn: 前两个是在Emacs中打开的，第三个是通过browse-url命令使用Web浏览器打开的(请参阅浏览器链接)。

source: The first two for are used for incomplete states, and the last two for completed states.
zh_cn: 前两个用于未完成状态，后两个用于已完成状态。

source: The following additional completion styles are also defined, and you can add them to completion-styles if you wish (see Customization):
zh_cn: 还定义了以下其他补全风格，如果您愿意，可以将它们添加到补全风格中(请参阅自定义)：

source: The following commands can be used with the completion list:
zh_cn: 以下命令可以与补全列表一起使用：

source: The following commands jump to other headlines in the buffer.
zh_cn: 以下命令跳转到缓冲区中的其他标题。

source: The following keys work if you turn off org-goto-auto-isearch
zh_cn: 如果关闭org-goto-auto-isearch，则以下键起作用

source: The global TODO list
zh_cn: 全局TODO列表

source: The global TODO list contains all unfinished TODO items formatted and collected into a single place.
zh_cn: 全局TODO列表会将所有未完成的TODO事项整合在一起显示。

source: The goal column remains in effect until canceled.
zh_cn: 目标列在取消之前保持有效。

source: The help commands C-h F function RET and C-h K key, described above, enter Info and go straight to the documentation of function or key.
zh_cn: 上述帮助命令C-h FRET和C-h K输入Info并直接转到函数或快捷键的文档。

source: The help commands to get information about a key sequence are C-h c (describe-key-briefly) and C-h k (describe-key).
zh_cn: 用于获取键序列信息的帮助命令是C-h c(describe-key-briefly)和C-h k(describe-key)。

source: The homepage for GNU Emacs is at https://www.gnu.org/software/emacs/.
zh_cn: GNU Emacs的主页位于https://www.gnu.org/software/emacs/.

source: The if and where of the table of contents.
zh_cn: 是否需要目录和目录的位置。

source: The ignored part of the file name is dimmed if the terminal allows it.
zh_cn: 如果终端允许，文件名中被忽略的部分将变暗。

source: The income from sales goes to support the foundation’s purpose: the development of new free software, and improvements to our existing programs including GNU Emacs.
zh_cn: 销售收入将用于支持基金会的目标：开发新的自由软件，并改进我们现有的程序，包括GNU Emacs。

source: The information to be shown is normally collected from all agenda files, the files listed in the variable org-agenda-files91.
zh_cn: 议程缓冲区显示的信息通常来自agenda file， 所谓agenda files 指的是变量org-agenda-files中的文件91。

source: The initial frame’s name is ‘F1’.
zh_cn: 初始窗体的名称为“F1”。

source: The item (or all items in the region) is filed below the target heading as a subitem.
zh_cn: 该项（或该区域中的所有项）作为子项转接在目标标题下方。

source: The key F1 serves as an alias for C-h.
zh_cn: F1键用作C-h的别名。

source: The keyboard commands C-f, C-b, C-n, and C-p move point to the right, left, down, and up, respectively.
zh_cn: 键盘命令C-f、C-b、C-n和C-p分别指向右、左、下和上。

source: The keys M-1, M-2, and so on, as well as M--, are bound to commands (digit-argument and negative-argument) that set up an argument for the next command.
zh_cn: 键M-1、M-2等等以及M--被绑定到为下一个命令设置参数的命令(数字参数和负参数)。

source: The last line of the window is a mode line.
zh_cn: 窗口的最后一行是状态栏。

source: The license for this documentation.
zh_cn: 此文档的许可证。

source: The line at the very bottom of the frame is the echo area.
zh_cn: 窗体最底部的一栏是回音区。

source: The list of matches may then become very long.
zh_cn: 然后，匹配的列表可能会变得非常长。

source: The list of previous minibuffer-using commands is stored as a Lisp list in the variable command-history.
zh_cn: 以前使用迷你缓冲区的命令列表以Lisp列表的形式存储在变量command-history中。

source: The list variable completion-styles specifies the completion styles to use.
zh_cn: 列表变量completion-styles指定要使用的补全风格。

source: The main area of the frame, below the tool bar (if one exists) and above the echo area, is called the window.
zh_cn: 位于工具栏(如果存在)下方、回显区上方的窗体主区域称为窗口。

source: The main interface.
zh_cn: 主界面。

source: The manual lists both the keys and the corresponding commands for accessing a functionality.
zh_cn: 该手册列出了用于访问一个功能的按键和相应的命令。

source: The mark: how to delimit a region of text.
zh_cn: 标记：如何界定文本区域。

source: The match syntax described here also applies when creating sparse trees with C-c / m.
zh_cn: 这里使用的匹配规则语法与创建sparse tree（C-c / m）时使用的语法是一样的。

source: The minibuffer is an Emacs buffer, albeit a peculiar one, and the usual Emacs commands are available for editing the argument text.
zh_cn: 迷你缓冲区是一个Emacs缓冲区，尽管这是一个特殊的缓冲区，并且可以使用常用的Emacs命令来编辑参数文本。

source: The minibuffer now contains ‘auto-f’, and the only command name that starts with this is auto-fill-mode.
zh_cn: 迷你缓冲区现在包含“auto-f”，并且唯一以此开头的命令名是auto-full-mode。

source: The minibuffer starts with a prompt, usually ending with a colon.
zh_cn: 迷你缓冲区以prompt开始，通常以冒号结束。

source: The minor mode called Overwrite mode causes inserted characters to replace (overwrite) existing text, instead of shoving it to the right.
zh_cn: 称为覆盖模式的辅模式会导致插入的字符替换(覆盖)现有文本，而不是将其推到右侧。

source: The most basic editing commands.
zh_cn: 最基本的编辑命令。

source: The name defined in org-footnote-section is reserved.
zh_cn: org-footnote-section中定义的名称是保留的。

source: The name is usually made of a few English words separated by dashes; for example, next-line or forward-word.
zh_cn: 名称通常由几个用短划线分隔的英文单词组成；例如，next-line或forward-word。

source: The next TAB makes it a parent, and so on, all the way to top level.
zh_cn: 下一次TAB使其成为父级，依此类推，一直到顶层。

source: The next element on the mode line is the string indicated by ch.
zh_cn: 状态栏上的下一个元素是ch指示的字符串。

source: The number after that is the total number of characters in the buffer, and the number in parenthesis expresses the position as a percentage of the total.
zh_cn: 后面的数字是缓冲区中的总字符数，括号中的数字以总字符数的百分比表示位置。

source: The order of things.
zh_cn: 事物的秩序。

source: The orgmode files
zh_cn: orgmode文件

source: The part in parentheses would then become:
zh_cn: 然后，括号中的部分将变为：

source: The place in the text where editing commands operate.
zh_cn: 文本中操作编辑命令的位置。

source: The precise conditions are found in the GNU General Public License that comes with Emacs and also appears in this manual1.
zh_cn: 确切的条件可以在Emacs附带的GNU通用公共许可证中找到，也可以在本手册1中找到。

source: The prefix key C-h stands for “help”.
zh_cn: 前缀键C-h代表“帮助”。

source: The previous example would be set globally by the following configuration:
zh_cn: 前面的示例将通过以下配置进行全局设置：

source: The problem with this is, however, is that then also the next instance of the repeated entry will not be active.
zh_cn: 然而，这样做的问题是，重复条目的下一个实例也将不会处于正在进行的状态。

source: The procedure of determining what constitutes a match is quite intricate.
zh_cn: 确定什么构成匹配的过程相当复杂。

source: The projects file
zh_cn: 项目文件

source: The prompt is highlighted using the minibuffer-prompt face (see Faces).
zh_cn: 提示符使用minibuffer-prompt字符样式突出显示(请参阅字符样式)。

source: The prompt states what kind of input is expected, and how it will be used.
zh_cn: 提示符说明预期的输入类型，以及将如何使用它。

source: The purpose of the weekly/daily agenda is to act like a page of a paper agenda, showing all the tasks for the current week or day.
zh_cn: 每周/每日议程的目的是充当纸质议程的页面，显示当前一周或一天的所有任务。

source: The real command name kill-backward will match that; if there were a command kill-text-before, it would also match, since it contains two of the specified words.
zh_cn: 实际的命令名kill-backward将与此匹配；如果有命令kill-text-before，它也会匹配，因为它包含两个指定的单词。

source: The reason is simple: unless an entry is an appointment (to the dentist for instance) or has a fixed deadline (a release scheduled with a customer), I should decide what to work on depending on the current context (among other things).
zh_cn: 原因很简单：除非条目是预约的(例如去看牙医)，或者有固定的截止日期(与客户安排的发布)，否则我应该根据当前的上下文(以及其他事情)来决定要做什么。

source: The recommended way to use Emacs is to start it just once, just after you log in, and do all your editing in the same Emacs session.
zh_cn: 建议使用Emacs的方法是在登录后只启动一次，然后在同一个Emacs会话中进行所有编辑。

source: The second type of yes-or-no query is typically employed if giving the wrong answer would have serious consequences; it thus features a longer prompt ending with ‘(yes or no)’.
zh_cn: 如果给出错误答案会产生严重后果，则通常使用第二种是或否查询；因此，它的提示以“(yes or no)”结尾。

source: The setting of suggest-key-bindings affects these hints as well.
zh_cn: suggest-key-bindings的设置也会影响这些提示。

source: The simplest kind of apropos pattern is one word.
zh_cn: 最简单的一种主题搜索的句型就是一个词。

source: The simplest way to enter a minibuffer argument is to type the text, then RET to submit the argument and exit the minibuffer.
zh_cn: 输入迷你缓冲区参数的最简单方法是键入文本，然后RET提交参数并退出迷你缓冲区。

source: The sole exception to this rule is ESC: ESC C-h is equivalent to C-M-h, which does something else entirely.
zh_cn: 此规则的唯一例外是ESC:ESCC-h等同于C-M-h，它执行完全不同的任务。

source: The standard value of completion-ignored-extensions has several elements including ".o", ".elc", and "~".
zh_cn: completion-ignored-extensions的标准值有几个元素，包括“.o”、“.elc”和“~”。

source: The string ‘M-x’ appears at the beginning of the minibuffer as a prompt to remind you to enter a command name to be run.
zh_cn: 字符串“M-x”显示在迷你缓冲区的开头，作为提示，提醒您输入要运行的命令名。

source: The syntax of capture templates is explained here.
zh_cn: 此处介绍了捕获模板的语法。

source: The syntax table says which characters are opening delimiters, which are parts of words, and so on.
zh_cn: 语法表说明哪些字符是开始分隔符，哪些是单词的一部分，等等。

source: The table editor as minor mode.
zh_cn: 表格编辑器作为次要模式。

source: The table editor has spreadsheet capabilities.
zh_cn: 具有电子表格功能的表格编辑器。

source: The tags interface shows the available tags in a splash window.
zh_cn: 标签界面在启动窗口中显示可用标签。

source: The text displayed in the mode line has the following format:
zh_cn: 状态栏中显示的文本格式如下：

source: The text inside the parenthesis shows the corresponding decimal, octal and hex character codes; for more information about how C-x = displays character information, see International Chars.
zh_cn: 括号内的文本显示相应的十进制、八进制和十六进制字符代码；有关C-x =如何显示字符信息的详细信息，请参阅国际字符。

source: The tickler
zh_cn: 备忘录

source: The tickler is one of the best concepts of GTD in my opinion.
zh_cn: 在我看来，备忘录是GTD最好的概念之一。

source: The undo command applies only to changes in the buffer; you can’t use it to undo cursor motion.
zh_cn: 撤消命令仅适用于缓冲区中的更改；您不能使用它来撤消光标移动。

source: The use of octal sequences is disabled in ordinary non-binary Overwrite mode, to give you a convenient way to insert a digit instead of overwriting with it.
zh_cn: 在普通的非二进制覆盖模式下禁用八进制序列，以便为您提供插入数字而不是用其覆盖的便捷方式。

source: The usual solution is to break your lines before they get too long, by inserting newlines.
zh_cn: 通常的解决方案是在行太长之前插入换行符。

source: The usual way to invoke Emacs is with the shell command emacs.
zh_cn: 调用Emacs的通常方式是使用shell命令emacs。

source: The value is t by default.
zh_cn: 默认情况下，该值为t。

source: The value of initial-buffer-choice may also be a function (of no arguments) that should return a buffer which is then displayed.
zh_cn: initial-buffer-choice的值也可以是一个函数(没有参数)，它应该返回一个缓冲区，然后显示该缓冲区。

source: The value of suggest-key-bindings can also be a number, in which case Emacs will show the binding for that many seconds before removing it from display.
zh_cn: suggest-key-bindings的值也可以是一个数字，在这种情况下，Emacs将在将绑定从显示中删除之前显示绑定的秒数。

source: The variable history-delete-duplicates specifies whether to delete duplicates in history.
zh_cn: 变量history-delete-duplicates指定是否删除历史记录中的重复项。

source: The variable history-length specifies the maximum length of a minibuffer history list; adding a new element deletes the oldest element if the list gets too long.
zh_cn: 变量history-length指定迷你缓冲区历史列表的最大长度；如果列表太长，添加新元素会删除最旧的元素。

source: The variable max-mini-window-height controls the maximum height for resizing the minibuffer window.
zh_cn: 变量max-mini-window-height控制调整迷你缓冲区窗口大小的最大高度。

source: The variable org-publish-project-alist
zh_cn: 变量org-Publish-project-ist

source: The variable resize-mini-windows controls the resizing of the minibuffer.
zh_cn: 变量resize-mini-windows控制迷你缓冲区的大小调整。

source: The views are created through a dispatcher, accessible with M-x org-agenda, or, better, bound to a global key (see Activation).
zh_cn: 各种议程视图都是通过一个调度程序创建的，其可以通过输入M-x org-agenda来显示，此外，更好的方式是将其绑定到一个全局快捷键上（详见激活

source: The yank level can also be specified with a numeric prefix argument, or by yanking after a headline marker like ‘****’.
zh_cn: 粘贴时的级别也可以使用数字前缀参数指定，或者通过粘贴标题标记(如“****”)来指定。

source: The ‘minimal-org.el’ setup file can have contents as shown below.
zh_cn: 'minimal-org.el”设置文件可以具有如下所示的内容。

source: The “Someday/Maybe” list
zh_cn: “将来/也许”清单

source: The “future history” for file names includes several possible alternatives you may find useful, such as the file name or the URL at point in the current buffer.
zh_cn: 文件名的“未来历史”包括几个您可能会觉得有用的备选方案，例如文件名或当前缓冲区中各点的URL。

source: Then C-n and C-p, when starting at the end of the logical line, move to the end of the next logical line.
zh_cn: 然后C-n和C-p从逻辑行的末尾开始，移动到下一个逻辑行的末尾。

source: Then read the basic information on variables (see Variables) and the information about specific variables will make sense.
zh_cn: 然后阅读有关变量的基本信息(请参阅变量)，有关特定变量的信息就有意义了。

source: Then typing F10 will run the command tmm-menubar instead of dropping down the menu.
zh_cn: 然后键入F10将运行命令tmm-menubar，而不是下拉菜单。

source: Then you no longer have to press RET to exit fast tag selection—it exits after the first change.
zh_cn: 然后，您不必再按RET退出快速标签选择-它在第一次更改后退出。

source: Then, activate the debugger:
zh_cn: 然后，激活调试器：

source: There are a large number of configuration options listed in this manual, but the only one you might want to tweak in advance is ~ebdb-sources~ (see [[id:9a02f8fb-01e2-4cd8-8166-608814a031f7][The EBDB Database]]), which controls where EBDB stores its records.
zh_cn: 此中列出了大量配置选项 手册，但您可能想要提前调整的唯一一个是 ~ebdb-sources~(请参阅[[id:9a02f8fb-01e2-4cd8-8166-608814a031f7][The EBDB数据库]])，它控制EBDB的位置 存储其记录。

source: There are compatibility issues between Org mode and some other Elisp packages (see Conflicts).
zh_cn: Org模式与某些其他Elisp软件包之间存在兼容性问题（请参见冲突）。

source: There are four types of behavior:
zh_cn: 有四种类型的行为：

source: There are several, including auto-fill-mode and autoconf-mode, but they all begin with auto, so the ‘au’ in the minibuffer completes to ‘auto’.
zh_cn: 有几个选项，包括auto-fill-mode和autoconf-mode，但它们都以auto开头，因此迷你缓冲区中的‘au’补全为‘auto’。

source: There are some restrictions on the minibuffer window, however: for instance, you cannot split it.
zh_cn: 但是，对迷你缓冲区窗口有一些限制：例如，您不能拆分它。

source: There are two ways to keep it more compact:
zh_cn: 有两种方法可以使其更加简洁紧凑。

source: There are two ways to use C-q:
zh_cn: C-q有两种使用方式：

source: There is a website for Org which provides links to the newest version of Org, as well as additional information, frequently asked questions (FAQ), links to tutorials, etc.
zh_cn: 有一个用于Org的网站，该网站提供指向Org最新版本的链接，以及其他信息，常见问题解答（FAQ），教程链接等。

source: There is also a special command for inserting tags:
zh_cn: 还有一个用于插入标签的特殊命令：

source: There is also a very simple completion style called emacs21.
zh_cn: 还有一种非常简单的补全风格，称为emacs21。

source: There is no history or completion, and you cannot change windows or perform any other action with Emacs until you have submitted the password.
zh_cn: 没有历史记录或补全，在提交密码之前，您不能使用Emacs更改窗口或执行任何其他操作。

source: There is no limit to the length of key sequences, but in practice they are seldom longer than three or four input events.
zh_cn: 键序列的长度没有限制，但实际上它们很少超过三个或四个输入事件。

source: There is one exception: apropos-variable without a prefix argument will always search for all variables, no matter what the value of apropos-do-all is.
zh_cn: 有一个例外：apropos-variable没有前缀参数将始终搜索所有变量，无论apropos-do-all的值是什么。

source: Therefore, although it behaves like a complex command, it normally does not appear in the history list for C-x ESC ESC
zh_cn: 因此，尽管它的行为类似于复杂命令，但它通常不会出现在C-x ESC ESC的历史记录列表中

source: Therefore, this manual mainly documents how to edit with the keyboard.
zh_cn: 因此，本手册主要介绍如何使用键盘进行编辑。

source: There’s no need to list them here, as you can more easily see them yourself.
zh_cn: 没有必要在这里列出它们，因为您可以更容易地亲眼看到它们。

source: These informative messages, unlike error messages, are not accompanied with a beep or flash.
zh_cn: 与错误信息不同，这些信息性消息不会伴随蜂鸣声或闪烁。

source: These commands act cyclically; for instance, typing TAB at the last hyperlink moves back to the first hyperlink.
zh_cn: 这些命令循环执行；例如，在最后一个超链接处键入TAB会返回到第一个超链接。

source: These commands are unusual, in that they use the minibuffer to read the regular expression argument, even though they are invoked from the minibuffer.
zh_cn: 这些命令是不寻常的，因为它们使用迷你缓冲区来读取正则表达式参数，即使它们是从迷你缓冲区调用的。

source: These commands attempt to complete the text in the minibuffer, based on a set of completion alternatives provided by the command that requested the argument.
zh_cn: 这些命令尝试根据请求参数的命令提供的一组补全选项来补全迷你缓冲区中的文本。

source: These dashes are omitted on a graphical display.
zh_cn: 这些破折号在图形显示上被省略。

source: These features are described later in the manual.
zh_cn: 本手册稍后将介绍这些功能。

source: These help commands are described in the following sections.
zh_cn: 以下各节将介绍这些帮助命令。

source: These terms require them to give you the full sources, including whatever changes they may have made, and to permit you to redistribute the GNU Emacs received from them under the usual terms of the General Public License.
zh_cn: 这些条款要求他们向您提供完整的源代码，包括他们可能做出的任何更改，并允许您根据通用公共许可证的通常条款重新分发从他们那里收到的GNU Emacs。

source: These unusual cases are described when they come up; they exist to make an individual command more convenient, and they are documented in that command’s documentation string.
zh_cn: 这些不寻常的情况会在出现时进行描述；它们的存在是为了使单个命令更方便，并且记录在该命令的文档字符串中。

source: They are then linked (using org-store-link) from Dired buffers into my projects for quick access.
zh_cn: 然后将它们从Dired缓冲区链接(使用org-store-link)到我的项目中，以便快速访问。

source: This will open a new buffer in ~ebdb-mode~, and prompt you to create a database, if one doesn't already exist.
zh_cn: 这 将在~ebdb-mode~中打开一个新缓冲区，并提示您创建 数据库(如果尚不存在)。

source: This startup screen contains information about Emacs and links to common tasks that are useful for beginning users.
zh_cn: 此启动屏幕包含有关Emacs的信息，并且链接指向对初学者有用的常见任务。

source: This adds the character to the buffer at point.
zh_cn: 这将在游标处将字符添加到缓冲区。
